#თამაში "რიცხვის გამოცნობა".
#შექმენით ცვლადი და შეინახეთ რომელიმე რიცხვი 1-დან 20-ის
#ჩათვლით(ეს იქნება ჩაფიქრებული რიცხვი). 
#გამოიყენეთ while loop-ი და მომხარებელს შემოატანინეთ რიცხვი
#იქამდე სანამ არ გამოიცნობს მას. თუ მომხარებლის მიერ შემოტანილი
#რიცხვი მეტია ჩაფიქრებულზე, დაპრინტეთ To high,
#თუ ნაკლებია Too low, ხოლო იმ შემთხვევაში თუ მომხარებელი
#  გამოიცნობს რიცხვს დაპრინტეთ "You win"

number = int(input("Enter Your Number : "))
while True :
    if number < 7 :
        print("Its Fear")
        break
    elif number == 7 :
        print("Winnerrrrr!!!!")
        break
    else:
        number > 7 
        print("Its Near") 
        break   

    

    








