#1) კარგად დაუკვირდით შემდეგ კოდს და ახსენით თითოეული მოქმედება კომენტარებით:
# ვქმნით რეინჯის შემცვლელ კოდს რომელიც იმავე სამუშაოს ასრულებს
def manual_range(end, start = 0, step = 1): # აქ დავუწერეთ დასაწყისი,დასასრული და ნაბიჯების დიაპაზონი
    while start <= end: # აქ გავუწერეთ პირობა თუ სანამდე უნდა გაგრძელებულიყო ციკლი დასაწყისიდან დასასრულამდე სანამ დასაწყისია არიქნებოდა დასასრულზე ნაკლები
        print(start) #აქ გამოგვაქ  დასაწყისის ციკლი და ველოდებით საბოლოო შედეგს
        start += step #აქ კი დასაწყისს ვუმატებთ ნაბიჯს
    
manual_range(10, 1, 2)