#კომენტარებით ახსენით თუ რა არის input-ი და output-ი, ასევე რისთვის გამოიყენება ისინი

"""input არის ერთგვარი ღილაკი რომელიც მომხმარებელს თხოვს შეიყვანოს მისი მონაცემები
კომპიუტერში რადგან ეს მონაცემები სამომავლოდ სჭირდება კომპიუტერს რადგან
დაიმახსოვროს კონკრეტული მომხმარებლის დეტალები როგორიცაა პაროლი, ასაკი,სახელი,
ბარათის მონაცემები და ბევრი რამ, ასე რომ ის ამ ინფორმაციით ქმნის შიდა საცავს რომელშიც
ინახება ყოველივე ეს ინფორმაცია"""

"""Output შეიძლება ჩაითვალოს შინაგანი ინფორმაციის  გარეთ გამოტანა მაგალითად
თუ შენი ინფორმაცია არ შეესადაგება სისწორეს მაგალითად რეგისტრაციის ველი კომპიუტერი გვაჩვენებს
რომ რაღაც არასწორია ან აკლია ეს გარემოება და ამ ყოველივეს გვიწერს მონიტორზე.
 შეიძლება შინაგანი პრობლემის გამოჩენა
ხმით ან წარწერით ან მოქმედებით, მინიშნებით,დამოკიდებულია იმაზე თუ რა არის ჩაშენებული მის
კოდებში"""