#5) ტექსტურ ფაილში ახსენით როდის ვიყენებთ while ციკლს და როდის for ციკლს

"""While ციკლს ვიყენებთ მანამ სანამ მომხმარებელი არ ჩაწერს სწორ პასუხს
პაროლს ან პინკოდს. მაგალითად მომხმარებლის რეალური პაროლი არის
NIKA1818 ჩვენ ვაძლევთ კომპიუტერს მითითებას რომ"""#სანამ
"""მომხმარებელი არ ჩაწერს სწორს პაროლს ანუ NIKA1818 მანამ 
ვერ გაივლის რეგისტრაციას და სისტემა ეტყვის რომ ცადოს ხელახლა"""

"""ხოლო For ციკლს ვიყენებთ როდესაც ვქმნით დიაპაზონს რაიმე რიცხვებს შორის რათა
გავიგოთ მათი მათემატიკური ამოხსნა"""